tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "heroku/brew"
# brew "asdf" # Minikube Version Management
# brew "bitrise"
# brew "carthage"
brew "cocoapods"
# brew "composer"
# brew "docker-machine-driver-hyperkit"
# brew "go"
# brew "ios-sim"
brew "heroku" # Also installs pkg-config, sphinx-doc, gdbm, makedepend, openssl, readline, sqlite, python@2, icu4c, node
# brew "kotlin"
# brew "kubernetes-cli"
# brew "lighttpd"
# brew "lua"
# brew "luarocks"
brew "mas"
# brew "mysql"
# brew "nginx"
# brew "node"
# brew "npm"
# brew "openssl"
# brew "php"
# brew "postgresql"
# brew "sqlite"
# brew "tree"
# brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Tapped brews
tap "dart-lang/dart"
brew "dart"

# Casks
cask "1password"
cask "android-studio"
# cask "atom"
# cask "docker"
# cask "cd-to"
# cask "docker"
cask "figma"
cask "firefox"
cask "flash-npapi" # safari / firefox
cask "flash-ppapi" # Opera / Chromium
cask "github"
cask "google-chrome"
# cask "imageoptim"
# cask "imagealpha" # lossy transparent png compression
# cask "iterm2"
# cask "minikube"
# cask "pgadmin4"
# cask "postman"
# cask "private-internet-access"
cask "pusher"
cask "spotify"
# cask "skype"
cask "sublime-text"
cask "shiftit"
# cask "tableplus"
# cask "transmission" # torrenting
cask "visual-studio-code"
# cask "virtualbox"
# cask "vlc"

# Mac App Store Apps
# mas "Battery Monitor", id: 836505650
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Server", id: 883878097
# mas "shazam", id: 897118787
# mas "Speedtest by Ookla", id: 1153157709
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
