tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
brew "zsh"
brew "z"
brew "carthage", args: ["HEAD"]
brew "go"
brew "openssl"
brew "nginx"
brew "postgresql"
brew "sqlite"
brew "mas"
brew "readline"
#brew "node"
#brew "heroku" # Also installs pkg-config, sphinx-doc, gdbm, makedepend, openssl, readline, sqlite, python@2, icu4c, node
#brew "npm"
#brew "mysql"

# Casks
cask "atom"
cask "firefox"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "private-internet-access"
cask "sublime-text"
cask "visual-studio-code"
cask "flash-npapi" # safari / firefox
cask "flash-ppapi" # Opera / Chromium
#cask "skype"
#cask "vlc"
#cask "spotify"
#cask "transmission" # torrenting
#cask "imageoptim"
#cask "imagealpha" # lossy transparent png compression
cask "dash"
cask "cd-to"
#cask "postman"


# Mac App Store Apps
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Keynote", id: 409183694
#mas "iMovie", id: 408981434
#mas "GarageBand", id: 682658836
#mas "Xcode", id: 497799835
#mas "shazam", id: 897118787
#mas "kindle", id: 405399194
